{
  "name": {
    "en": "CHEN JIA",
    "zh": "陈佳"
  },
  "contact": {
    "email": "e1285215@u.nus.edu",
    "phone_cn": "+8615903538062",
    "phone_sg": "+6580395624",
    "github": "https://github.com/JIAtype",
    "linkedin": "linkedin.com/in/jia-chen-950127290"
  },
  "profile": {
    "en": "An AI Engineer-in-Training committed to utilizing diverse technologies and continuously improving skills to efficiently solve problems. With a solid foundation in software engineering and practical experience in model deployment within the fields of computer vision, business analytics, industrial automation, and robotics applications. Eager to leverage various technologies and expertise to contribute to the innovative AI solutions. Expected to graduate in November 2025.",
    "zh": "热衷于学习并应用前沿AI技术与工具解决实际问题,有软件工程基础及开发经验。拥有模式识别、数据分析、计算机视觉、分析推理及机器人领域的项目实际开发经验,以及在现实工厂制造工作环境部署经历。预计于2025年8月完成研究生课程,并于2025年11月完成研究生学历留服认证。"
  },
  "education": [
    {
      "institution": { "en": "National University of Singapore - Institute of Systems Science", "zh": "新加坡国立大学" },
      "degree": { "en": "Master of Technology in Artificial Intelligence Systems", "zh": "人工智能硕士" },
      "duration": { "en": "Aug 2024 - Present", "zh": "2024.08至今" },
      "details_en": ["Graduate Diploma in Systems Analysis (Aug 2023 - Sep 2024)"],
      "details_zh": []
    },
    {
      "institution": { "en": "North University of China - Software School", "zh": "中北大学" },
      "degree": { "en": "Bachelor of Software Engineering", "zh": "软件工程学士" },
      "duration": { "en": "Sep 2018 - Jun 2022", "zh": "2018.09 - 2022.06" },
      "honors_en": ["NUC Comprehensive Excellence Scholarship Recipient (All Years).", "The third prize of the Blue Bridge Cup Java Group."],
      "honors_zh": ["连续四年获综合素质奖学金", "蓝桥杯 java 组省三等奖"]
    }
  ],
  "skills": {
    "programming_ai": {
        "en": "Python, C++, Java, SQL, PyTorch, TensorFlow, Keras, Hugging Face Transformers, LangChain, Scikit-learn, CNN, RNN, YOLO, Transformers, Large Language Models, Time Series Analysis, Natural Language Processing, Pattern Recognition, Prompt Engineering, Hyperparameter Tuning, Model Optimization, Feature Engineering.",
        "zh": "Python, C++, SQL, PyTorch, TensorFlow, Keras, Hugging Face Transformers, LangChain, Scikit-learn, CNN, RNN, Transformers, LLMs, Time Series Analysis, NLP, OpenCV, Roboflow, LabelMe, EDA, Matplotlib, Seaborn, Plotly, Power BI, Docker, Git, n8n, Google AI Studio..."
    },
    "computer_vision_robotics": {
        "en": "OpenCV, Roboflow, LabelMe, ROS, SLAM, Edge AI.",
        "zh": "(中文简历中未明确分类，可从项目经验中提取或合并)"
    },
    "data_engineering_analytics": {
        "en": "EDA, Matplotlib, Seaborn, Plotly, Power BI, Streamlit.",
        "zh": "(中文简历中未明确分类，可从项目经验中提取或合并)"
    },
    "mlops_deployment": {
        "en": "MLflow, Docker, REST APIs, CI/CD, GitHub, Bitbucket, Linux, n8n, Google AI Studio.",
        "zh": "(中文简历中未明确分类，可从项目经验中提取或合并)"
    }
  },
  "experience": [
    {
      "company": { "en": "Shimano (Singapore) Pte. Ltd.", "zh": "Shimano 禧玛诺(新加坡)私人有限公司" },
      "role": { "en": "Data Scientist Intern", "zh": "数据科学实习生" },
      "duration": { "en": "Mar 2025 - Present", "zh": "2025.03至今" },
      "projects_en": [
        {
          "name": "AI Powered Working Instruction for Industrial Manufacturing",
          "description": "Based on Gemini, developed an AI workflow for industrial video-to-document conversion, which enables automatic image and text generation and multi-language translation, and improves document compilation efficiency by 70%."
        },
        {
          "name": "Parts Surface Defect Detection",
          "description": "Build a real-time defect detection system based on Raspberry Pi and computer vision, fine-tune the model to identify and classify surface defects of parts, and improve quality inspection efficiency by 40%."
        },
        {
            "name": "AI Detection System for Workplace Safety",
            "description": "Customized the YOLOv8 model, developed a fall detection system, and combined it with workplace monitoring to detect personnel behavior in real time, increasing the accuracy of safety accident warnings to 92%."
        },
        {
            "name": "Root Cause Analysis for NC Parts",
            "description": "Conducted statistical root cause analysis on NC (Non-Conforming) parts using ensemble ML models, identifying top 5 most important influencers and delivering process optimization."
        }
      ],
      "projects_zh": [
        {
          "name": "AI流程自动化",
          "description": "基于Gemini 开发工业视频转文档 AI工作流,实现图文自动生成与多语言翻译,文档编制效率提升70%。"
        },
        {
          "name": "视觉质检系统",
          "description": "搭建基于树莓派与计算机视觉的实时缺陷检测系统,微调模型使其识别并分类标注零件表面缺陷,质检效率提升40%。"
        },
        {
            "name": "智能安防监控",
            "description": "定制 YOLOv8 模型开发跌倒检测系统,结合工作间监控实时检测人员行为,将安全事故预警准确率提升至92%。"
        },
        {
            "name": "生产优化分析",
            "description": "通过机器学习定位生产不合格零件关键影响因素,给出生产流程分析报告与图标,提出优化方案使良品率提升15%。"
        }
      ]
    },
    {
      "company": { "en": "Systems on Silicon Manufacturing Co. Pte. Ltd.", "zh": "SSMC硅系统制造有限公司(新加坡)" },
      "role": { "en": "Software Engineer Intern", "zh": "软件工程实习生" },
      "duration": { "en": "Mar 2024 - Jul 2024", "zh": "2024.03 - 2024.07" },
      "projects_en": [
        {
          "name": "Enterprise Wafer Management System",
          "description": "Developed scalable offline wafer tracking system with SQL Server database. Integrated K2 workflow automation engine, reducing manual data entry by 60% and implementing automated alert for supply control compliance."
        }
      ],
      "projects_zh": [
        {
          "name": "可扩展离线晶圆追踪系统",
          "description": "利用 SQL Server 数据库,集成 K2 工作流自动化引擎,搭建并部署完整系统。减少了 60%的手动数据录入,并实现了自动预警功能,确保质量控制符合标准。"
        }
      ]
    }
  ],
  "projects": [
    {
      "name_en": "Intelligent Personal Recruitment Assistant",
      "name_zh": "个人智能虚拟应聘助理",
      "status_en": "Under Development",
      "status_zh": "2025.06 (预计)",
      "description_en": "Architecture: React frontend with Fine-tuning dual-LLM model backend (Llama 3 for English, Qwen for Chinese). Innovation: Implemented RAG (Retrieval-Augmented Generation) with vectorized personal data storage, achieving contextually relevant multi-turn conversations. Integration: MCP protocol integration, cross-platform data aggregation, and behavioral analytics dashboard.",
      "description_zh": "设计并实现集个人展示、智能问答于一体的个性化简历展示界面。构建 React 交互界面,使用 MCP 集成 Llama 3与 Qwen 双大语言模型支持结合上下文的多轮对话。采用 RAG 技术优化对话体验,使得招聘团队高效了解候选人信息。"
    },
    {
      "name_en": "Social Media Analytics Platform",
      "name_zh": "视频评论分析",
      "status_en": "May 2025",
      "status_zh": "2025.05",
      "description_en": "Developed comprehensive YouTube comment analysis system using VADER sentiment analysis, BART summarization, and custom topic modeling. Achieved 94% accuracy in spam detection through comparative analysis of MultinomialNB, BernoulliNB, SVM, Random Forest, Logistic Regression classifiers. Processed 2K comments dataset with preprocessing and visualization techniques.",
      "description_zh": "爬取 YouTube 视频海量评论,利用自然语言处理技术进行系统化分析,包括主题建模、情感分析和文本分类(垃圾评论检测)。开发Streamlit 交互面板,可视化数据分析报告及图表。"
    },
    {
        "name_en": "Autonomous Mobility System for Smart Waste Bin",
        "name_zh": "自主移动垃圾桶",
        "status_en": "Mar 2025",
        "status_zh": "2025.03",
        "description_en": "Deployed TurtleBot3 with ROS, implementing SLAM navigation and path planning. Integrated Raspberry Pi 4 embedded controller with ultrasonic, load cell, and proximity sensors for real-time bin monitoring. Implemented TCP/IP protocol for centralized dashboard control and status reporting.",
        "description_zh": "基于ROS与SLAM以及路径规划算法部署 TurtleBot3 实现机器人自主导航。集成多传感器通过 TCP/IP 协议,实现智能监控与远程管理。"
    },
    {
        "name_en": "Consumer Intelligence & Predictive Analytics",
        "name_zh": "消费者分析与消费行为预测",
        "status_en": "Oct 2024",
        "status_zh": "2024.10",
        "description_en": "Engineered decision tree classifier with RFE and Random Forest ensemble, achieving 92% accuracy in high-value customer identification. Implemented K-Means clustering with elbow method optimization for RFM customer segmentation. Built interactive Plotly dashboard with radar charts and PCA dimensionality reduction for business intelligence.",
        "description_zh": "分析消费者的购买行为和产品数据,运用随机森林,识别出高价值消费者。K-Means 等算法完成消费者画像。通过关联规则挖掘推荐产品组合以促进销售,并优化库存管理。"
    }
  ],
  "other": {
    "leadership_experience_en": "Vice Minister, Student Council Employment Department. Organized recruitment events and industry partnerships, enhancing communication skills.",
    "leadership_experience_zh": "曾任学生会就业部副部长,组织多场校园及学院招聘活动。",
    "certifications_en": "CPR & AED Certified | Open Water Diver | C1 Driving License (China)...",
    "certifications_zh": "普通话二级甲等、C1驾驶证、开放水域潜水证、CPR&AED 急救认证。",
    "personal_interests_en": "Technical Innovation Research | Swimming | Mountain Hiking.",
    "personal_interests_zh": "研究新技术、游泳、登山。"
  }
}